Repository: Webpixelia/form-quizz-fqi3
Catalog: languages/form-quizz-fqi3-*.po
Languages: fr_fr

source: Example Response
fr_fr: Exemple de réponse

source: Example Request:
fr_fr: Exemple de requête :

source: Response Format:
fr_fr: Format de réponse:

source: Responses are returned in JSON format and contain either the requested data or appropriate error messages.
fr_fr: Les réponses sont renvoyées au format JSON et contiennent soit les données demandées, soit les messages d'erreur appropriés.

source: Changelog
fr_fr: Journal des modifications

source: Changelog file is not readable.
fr_fr: Le fichier changelog n’est pas lisible.

source: Failed to read changelog file.
fr_fr: Échec de la lecture du fichier journal des modifications.

source: No changelog section found.
fr_fr: Aucune section de journal des modifications trouvée.

source: No version entries found.
fr_fr: Aucune entrée de version trouvée.

source: No changelog entries found.
fr_fr: Aucune entrée du journal des modifications trouvée.

source: Set Quiz Levels
fr_fr: Définir les niveaux du quiz

source: Level ID:
fr_fr: ID de niveau:

source: Your input will be automatically formatted to ensure it meets the requirements: Use lowercase letters only and no spaces or accents; hyphens (-) are allowed.
fr_fr: Vos données seront automatiquement formatées pour s'assurer qu'elles répondent aux exigences : Utilisez uniquement des lettres minuscules, sans espaces ni accents ; les traits d'union (-) sont autorisés.

source: Level Name:
fr_fr: Nom du niveau:

source: Is Free?
fr_fr: Est-il gratuit ?

source: Remove this level
fr_fr: Supprimer ce niveau

source: Add a level
fr_fr: Ajouter un niveau

source: Beginner
fr_fr: Débutant

source: Intermediate
fr_fr: Intermédiaire

source: Advance
fr_fr: Avancé

source: Form Quizz FQI3 Settings
fr_fr: Réglages Form Quizz FQI3

source: Save settings
fr_fr: Enregistrer les paramètres

source: Statistics
fr_fr: Statistiques

source: Refresh Statistics
fr_fr: Actualiser les statistiques

source: Color codes:
fr_fr: Codes de couleur :

source: User ID
fr_fr: ID de l’utilisateur

source: Username
fr_fr: Nom d’utilisateur

source: Awards / Badges
fr_fr: Récompenses / Badges

source: No user statistics available yet.
fr_fr: Aucune statistique utilisateur n’est encore disponible.

source: No badges awarded yet!
fr_fr: Aucun badge n’a encore été attribué !

source: This user has not yet earned a badge.
fr_fr: Cet utilisateur n’a pas encore obtenu de badge.

source: earned at %s
fr_fr: attribué le %s

source: Deleted User
fr_fr: Utilisateur supprimé

source: Viewing questions
fr_fr: Affichage des questions

source: Add a question
fr_fr: Ajouter une question

source: Access
fr_fr: Accès

source: Level
fr_fr: Niveau

source: Instructions for the question
fr_fr: Instructions pour la question

source: Answer
fr_fr: Réponse

source: Edit
fr_fr: Modifier

source: All
fr_fr: Tous

source: All Levels
fr_fr: Tous les niveaux

source: Free
fr_fr: Gratuit

source: Search questions...
fr_fr: Rechercher des questions…

source: Filter
fr_fr: Fltrer

source: Export CSV
fr_fr: Exporter au format CSV

source: of
fr_fr: sur

source: Previous
fr_fr: Précédent

source: Next
fr_fr: Suivant

source: Delete
fr_fr: Supprimer

source: Show Options
fr_fr: Afficher Options

source: Unknown
fr_fr: Inconnue

source: No questions found for export
fr_fr: Aucune question n'a été trouvée pour l’export

source: Export Error
fr_fr: Erreur d’exportation

source: View Questions
fr_fr: Voir les questions

source: Add Question
fr_fr: Ajouter une question

source: Edit Question
fr_fr: Modifier la question

source: General Settings
fr_fr: Réglages généraux

source: Levels Settings
fr_fr: Réglages des niveaux

source: Access Control
fr_fr: Contrôle d'accès

source: Emails Options
fr_fr: Options Emails

source: Content Options
fr_fr: Options de contenu

source: Badges Options
fr_fr: Options Badges

source: API Options
fr_fr: Options de l'API

source: Token successfully revoked.
fr_fr: Jeton révoqué avec succès.

source: Database error occurred
fr_fr: Une erreur de base de données s’est produite

source: Failed to retrieve quiz:
fr_fr: Impossible de récupérer le questionnaire :

source: Failed to retrieve quizzes due to a database error
fr_fr: Impossible de récupérer les questionnaires en raison d’une erreur de base de données

source: An error occurred while retrieving user badges.
fr_fr: Une erreur s’est produite lors de la récupération des badges utilisateur.

source: Failed to retrieve performance data
fr_fr: Impossible de récupérer les données de performances

source: Performance updated successfully
fr_fr: Performances mises à jour avec succès

source: Failed to update performance
fr_fr: Échec de la mise à jour des performances

source: Invalid badge type specified
fr_fr: Type de badge spécifié non valide

source: Completed Quizzes
fr_fr: Quiz complétés

source: achieve a specific number of quizzes
fr_fr: atteindre un nombre spécifique de quiz

source: Success Rate
fr_fr: Taux de réussite

source: have a specific success rate since a specific number of quizzes (%s)
fr_fr: avoir un taux de réussite spécifique depuis un nombre spécifique de quiz (%s)

source: List of existing badges
fr_fr: Liste des badges existants

source: Badge Type
fr_fr: Type du badge

source: How to get it
fr_fr: Comment l’obtenir

source: Badges versions
fr_fr: Versions des badges

source: You need to %s
fr_fr: Vous devez %s

source: Questions per page
fr_fr: Questions par page

source: FQI3 Test Email
fr_fr: Email de test de FQI3

source: Your Free Quiz Attempts Have Been Reset
fr_fr: Vos tentatives de quiz gratuit ont été réinitialisées

source: Hi
fr_fr: Bonjour

source: Your wait is over! <br><br> 24 hours have passed, so you have 3 free quizzes available again.
fr_fr: Votre attente est terminée ! <br><br> 24 heures se sont écoulées, vous avez donc à nouveau 3 quiz gratuits disponibles.

source: Hi admin! Your email sending test is successful.
fr_fr: Bonjour administrateur ! Votre test d’envoi d’email a réussi.

source: Hello, this is a generic message from the FQI3 plugin.
fr_fr: Bonjour, ceci est un message générique du plugin FQI3.

source: Default Title
fr_fr: Titre par défaut

source: Choose your level:
fr_fr: Choisissez votre niveau :

source: As no logged user, you are only acces to:
fr_fr: En tant qu’utilisateur non connecté, vous avez uniquement accès à :

source: Start
fr_fr: Commencer

source: Welcome, %s. Happy to see you again for some fun learning!
fr_fr: Bienvenue, %s. Heureux de te revoir pour un moment d’apprentissage ludique !

source: Loading...
fr_fr: Chargement en cours…

source: Results
fr_fr: Résultats

source: Restart the quizz
fr_fr: Redémarrer le quiz

source: Sign Up to Access More Levels
fr_fr: S'inscrire pour accéder à d'autres niveaux

source: Go back to the start
fr_fr: Revenir au début

source: Share your results:
fr_fr: Partagez vos résultats :

source: Share on Facebook
fr_fr: Partager sur Facebook

source: Share on X
fr_fr: Partager sur X

source: Share on LinkedIn
fr_fr: Partager sur LinkedIn

source: Upgrade to our premium version to get unlimited access!
fr_fr: Passe à notre version premium pour bénéficier d'un accès illimité !

source: View Details and register
fr_fr: Voir les détails et s’inscrire

source: Do you want to activate a timer to complete the 10 questions?
fr_fr: Voulez-vous activer un minuteur pour compléter les 10 questions ?

source: How many minutes?
fr_fr: Combien de minutes ?

source: You have reached your quiz limit for today.
fr_fr: Vous avez atteint votre limite de quiz pour aujourd'hui.

source: No questions found in %s level.
fr_fr: Aucune question n'a été trouvée au niveau %s.

source: No data found for the specified period.
fr_fr: Aucune donnée trouvée pour la période spécifiée.

source: your advanced statistics
fr_fr: vos statistiques avancées

source: Your advanced statistics
fr_fr: Vos statistiques avancées

source: No advanced statistics yet but that shouldn't last long if you keep up your efforts by regularly completing quizzes.
fr_fr: Il n'y a pas encore de statistiques avancées, mais cela ne devrait pas durer longtemps si vous continuez à faire des efforts en répondant régulièrement aux quiz.

source: Monthly Statistics
fr_fr: Statistiques mensuelles

source: Weekly Statistics
fr_fr: Statistiques hebdomadaires

source: Field %s is required.
fr_fr: Le champ %s est obligatoire.

source: Invalid user ID.
fr_fr: ID utilisateur non valide.

source: Invalid date format.
fr_fr: Format de date non valide.

source: End date must be after start date.
fr_fr: La date de fin doit être postérieure à la date de début.

source: Date range cannot exceed %d days.
fr_fr: La plage de dates ne peut pas dépasser %d jours.

source: End date cannot be in the future.
fr_fr: La date de fin ne peut pas être dans le futur.

source: Statistics recorded successfully for user.
fr_fr: Statistiques enregistrées avec succès pour l’utilisateur.

source: Invalid date format provided.
fr_fr: Format de date non valide fourni.

source: End date cannot be before start date.
fr_fr: La date de fin ne peut pas être antérieure à la date de début.

source: Failure Rate
fr_fr: Taux d’échec

source: Statistics updated successfully
fr_fr: Statistiques mises à jour avec succès

source: User not logged in or does not have the required role
fr_fr: L’utilisateur n’est pas connecté ou n’a pas le rôle requis

source: No statistics found for your account.
fr_fr: Aucune statistique trouvée pour votre compte.

source: this section
fr_fr: cette section

source: Statistics option disabled. For more details, please inquire with the administrator.
fr_fr: Option statistiques désactivée. Pour plus de détails, veuillez vous adresser à l'administrateur.

source: If you want to access %s, you must be logged in.
fr_fr: Si vous voulez accéder à %s, vous devez être connecté.

source: You must be a premium member to view %s.
fr_fr: Vous devez être un membre premium pour voir %s.

source: Your statistics
fr_fr: Vos statistiques

source: Total Quizzes
fr_fr: Total des quiz

source: Total Questions Answered
fr_fr: Nombre total de questions répondues

source: Correct Answers
fr_fr: Réponses correctes

source: Overall average
fr_fr: Moyenne générale

source: Best Score
fr_fr: Meilleur note

source: Average Score
fr_fr: Note moyenne

source: %s quiz completed
fr_fr: %s quiz complété

source: in %s level
fr_fr: au niveau %s

source: No statistics
fr_fr: Aucune statistique

source: Comparative Statistics
fr_fr: Statistiques comparatives

source: Your Best Score
fr_fr: Votre meilleur score

source: The Best Overall Score
fr_fr: Le meilleur score globale

source: You do not have access to this feature
fr_fr: Vous n'avez pas accès à cette fonctionnalité

source: No data yet
fr_fr: Pas données pour le moment

source: No badges found for your account.
fr_fr: Aucun badge n'a été trouvé pour votre compte.

source: your badges
fr_fr: vos badges

source: Awarded badge
fr_fr: Badge gagné

source: No badges awarded.
fr_fr: Aucun badge reçu.

source: Awarded on
fr_fr: Attribué le

source: Template %s not found.
fr_fr: Modèle %s non trouvé.

source: Thank you
fr_fr: Merci

source: %1$s is developed and maintained by <a href="%2$s" target="_blank">%3$s</a>.
fr_fr: %1$s est développé et entretenu par <a href="%2$s" target="_blank">%3$s</a>.

source: Manually Record Weekly Statistics
fr_fr: Enregistrement manuel des statistiques hebdomadaires

source: User:
fr_fr: Utilisateur :

source: Start Date:
fr_fr: Date de début:

source: End Date:
fr_fr: Date de fin:

source: Record Statistics
fr_fr: Enregistrer les statistiques

source: Incorrect answers
fr_fr: Réponses incorrectes

source: Here is the list of questions that you did not answer correctly and that you could rework
fr_fr: Voici la liste des questions auxquelles tu n’as pas correctement répondues et que tu pourrais retravailler

source: Your answer
fr_fr: Votre réponse

source: Good answer
fr_fr: Bonne réponse

source: What level?
fr_fr: Quel niveau ?

source: Instructions for the question:
fr_fr: Instructions pour la question :

source: Possible answers:
fr_fr: Réponses possibles :

source: Answer choice %d:
fr_fr: Choix de réponse %d :

source: Select the correct answer:
fr_fr: Sélectionne la bonne réponse:

source: Answer choice %d
fr_fr: Choix de réponse %d

source: MCQs / Day
fr_fr: QCM / Jour

source: Unlimited MCQs
fr_fr: QCM illimités

source: Upgrade to unlimited
fr_fr: Passez à illimité
