Repository: Webpixelia/form-quizz-fqi3
Catalog: languages/form-quizz-fqi3-*.po
Languages: fr_fr

source: A plugin to create and manage free quizzes with premium features.
fr_fr: Un plugin pour créer et gérer des quiz gratuits avec des fonctionnalités premiers.

source: Form Quizz FQI3 requires PHP version %2$s or higher. Your current version is %1$s.
fr_fr: Le formulaire Quizz FQI3 nécessite la version PHP %2$s ou supérieure. Votre version actuelle est %1$s.

source: Are you sure you want to revoke the API token?
fr_fr: Êtes-vous sûr de vouloir révoquer le jeton API ?

source: Unable to copy the shortcode. Please try again.
fr_fr: Impossible de copier le code court. Veuillez réessayer.

source: Insert image
fr_fr: Insérer une image

source: Use this image
fr_fr: Utiliser cette image

source: Upload image
fr_fr: Télécharger l’image

source: Settings
fr_fr: Réglages

source: Please select a level before starting the quiz.
fr_fr: Sélectionne un niveau avant de commencer le quiz.

source: You have reached the limit of %s quizzes per day as a free logged in user.
fr_fr: Vous avez atteint la limite de %s quiz par jour en tant qu’utilisateur connecté gratuitement.

source: You have %1$s correct answer on %2$s. (%3$s%) for the %4$s level
fr_fr: Vous avez %1$s réponse correcte sur %2$s. (%3$s%) pour le niveau %4$s

source: You have %1$s correct answers on %2$s. (%3$s%) for the %4$s level
fr_fr: Vous avez %1$s réponses correctes sur %2$s. (%3$s%) pour le niveau %4$s

source: Select an answer before moving on to the next question.
fr_fr: Sélectionne une réponse avant de passer à la question suivante.

source: on
fr_fr: sur

source: Oops! Your time is up! Feel free to try again.
fr_fr: Oups ! Votre temps est écoulé! N’hésite pas à réessayer.

source: I just finished the quiz on %1$s and I answered %2$s of %3$s questions correctly; that's %4$s%. Try it too; it's free!
fr_fr: Je viens de terminer le quiz sur %1$s et j’ai répondu correctement à %2$s des %3$s questions ; soit %4$s%. Essayez-le aussi, c’est gratuit !

source: This feature allows specific roles with at least the capability to publish posts to access the question management (viewing, editing, and deleting questions). However, access to plugin settings is restricted to administrators only.
fr_fr: Cette fonctionnalité permet à des rôles spécifiques ayant au moins la capacité de publier des messages d’accéder à la gestion des questions (affichage, modification et suppression des questions). Cependant, l’accès aux paramètres du plugin est limité aux administrateurs uniquement.

source: Who can manage questions?
fr_fr: Qui peut gérer les questions ?

source: Please note: The Administrator role cannot be disabled and always has access to plugin settings.
fr_fr: Attention : le rôle d’administrateur ne peut pas être désactivé et a toujours accès aux paramètres du plugin.

source: Add question
fr_fr: Ajouter une question

source: Security check failed
fr_fr: Le contrôle de sécurité a échoué

source: Field %s is required
fr_fr: Le champ "%s" est obligatoire

source: Answer %d cannot be empty
fr_fr: La réponse %d ne peut pas être vide

source: Invalid correct answer selection
fr_fr: Sélection de la bonne réponse invalide

source: Error encoding answers
fr_fr: Réponses à l'encodage des erreurs

source: Database error occurred while inserting the question
fr_fr: Une erreur de base de données s'est produite lors de l'insertion de la question

source: Enable API Rest
fr_fr: Activer API Rest

source: API Token
fr_fr: Jeton API

source: Allow access to plugin data via the REST API
fr_fr: Permettre l'accès aux données du plugin via l'API REST

source: Generate Token
fr_fr: Générer un jeton

source: Revoke Token
fr_fr: Révoquer le jeton

source: Click the button to generate a new API token.
fr_fr: Cliquez sur le bouton pour générer un nouveau jeton API.

source: Show/Hide Token
fr_fr: Afficher/Masquer le jeton

source: Copy token
fr_fr: Copier le jeton

source: The generated token will appear above. Click Save Settings to store it.
fr_fr: Le jeton généré apparaîtra ci-dessus. Cliquez sur Enregistrer les paramètres pour le stocker.

source: Do not share your API token and ensure it is stored securely.
fr_fr: Ne partagez pas votre jeton API et assurez-vous qu’il est stocké en toute sécurité.

source: The API documentation can be found <a href="%s#api_doc" target="_blank" rel="noopener noreferrer">here</a>.
fr_fr: La documentation de l’API peut être consultée <a href="%s#api_doc" target="_blank" rel="noopener noreferrer">ici</a>.

source: Disable badges
fr_fr: Désactiver les badges

source: Disable badges legend
fr_fr: Désactiver la légende des badges

source: Quiz Completion Badge Level
fr_fr: Badge Niveau d’achèvement de quiz

source: Success Rate Badge Level
fr_fr: Badge Niveau du taux de réussite

source: Check this to disable the badges system.
fr_fr: Cochez cette case pour désactiver le système de badges.

source: Please note that this option only works if statistics are not disabled in general settings.
fr_fr: Veuillez noter que cette option ne fonctionne que si les statistiques ne sont pas désactivées dans les paramètres généraux.

source: Check this to disable the display of the badges legend below the user earned badges display section.
fr_fr: Cochez cette case pour désactiver l'affichage de la légende des badges sous la section d'affichage des badges gagnés par l'utilisateur.

source: Threshold:
fr_fr: Seuil:

source: Badge Name:
fr_fr: Nom du badge:

source: Badge Image:
fr_fr: Image de badge :

source: Remove Image
fr_fr: Supprimer l’image

source: Upload Image
fr_fr: Télécharger l’image

source: Remove this badge
fr_fr: Supprimer ce badge

source: Add a badge
fr_fr: Ajouter un badge

source: Minimum quizzes completed to start assigning success rate badges:
fr_fr: Nombre minimum de questionnaires terminés pour commencer à attribuer des badges de taux de réussite :

source: RTL mode for table
fr_fr: Mode RTL pour tableau

source: Enable RTL (Right-to-Left) mode
fr_fr: Activer le mode RTL (de droite à gauche)

source: Check this to activate RTL layout for languages like Arabic or Hebrew for the question overview table.
fr_fr: Cochez cette case pour activer la disposition RTL pour des langues comme l’arabe ou l’hébreu pour le tableau de synthèse des questions.

source: Title/Description Pre Form Text
fr_fr: Titre/Description avant le formulaire de quiz

source: Title/Description Pre Form Color
fr_fr: Titre/Description d’avant formulaire

source: Top Question Text Color
fr_fr: Couleur du texte de x sur y questions

source: Top Question Background Color
fr_fr: Couleur du fond de x sur y questions

source: Button Text Color
fr_fr: Couleur de texte du bouton

source: Button Background Color
fr_fr: Couleur du fond du bouton

source: Default:
fr_fr: Valeur par défaut:

source: Reset
fr_fr: Réinitialiser

source: Edit question
fr_fr: Modifier la question

source: Security check failed.
fr_fr: Échec du test de sécurité.

source: Question not found.
fr_fr: Question non trouvée.

source: Error: Question options not found or invalid.
fr_fr: Erreur : Les options de la question n'ont pas été trouvées ou ne sont pas valides.

source: Invalid question ID
fr_fr: ID de la question invalide

source: Failed to encode answers
fr_fr: Impossible d’encoder les réponses

source: Failed to update question.
fr_fr: Échec de la mise à jour de la question.

source: Invalid question ID. Please choose the question to modify in the question consultation page.
fr_fr: ID de question invalide. Choisissez la question à modifier dans la page de consultation des question.

source: View questions
fr_fr: Voir les questions

source: Disable email notification
fr_fr: Désactiver les notifications par email

source: Upload Email Image
fr_fr: Télécharger l’image de l’email

source: Email Send Hour
fr_fr: Heure d'envoi de l’email

source: Email CTA settings
fr_fr: Paramètres du CTA de l’e-mails

source: Send Test Email to WP admin
fr_fr: Envoyer un e-mail de test à l’administrateur WordPress

source: Disable email notifications
fr_fr: Désactiver les notifications par e-mail

source: Check this to disable the email notifications.
fr_fr: Cochez cette case pour désactiver les notifications par e-mail.

source: Select the time (HH:MM) for sending reminder emails.
fr_fr: Sélectionnez l’heure (HH:MM) d’envoi des e-mails de rappel.

source: Test Cron Execution
fr_fr: Tester l’exécution de Cron

source: Go to the site
fr_fr: Visitez le site

source: Email CTA link
fr_fr: Lien CTA de l’e-mail

source: Email CTA Label
fr_fr: Texte du CTA de l’e-mail

source: Link Text Color
fr_fr: Couleur de texte du bouton

source: Link Background Color
fr_fr: Couleur de fond du bouton

source: Send Test Email
fr_fr: Envoyer un email test

source: Email sending is disabled.
fr_fr: L’envoi d’e-mails est désactivé.

source: Test email has been sent.
fr_fr: L’email test a été envoyé.

source: Delete data on uninstall
fr_fr: Supprimer les données lors de la désinstallation

source: Social sharing of results
fr_fr: Partage social des résultats

source: Disable statistics
fr_fr: Désactiver les statistiques

source: Link to the sales page
fr_fr: Lien vers la page de vente

source: Number of free trials per day
fr_fr: Nombre d'essais gratuits par jour

source: Number of questions per quiz
fr_fr: Nombre de questions par quiz

source: Check this to delete data on uninstall
fr_fr: Coche ceci pour supprimer les données lors de la désinstallation

source: Disable social sharing of results
fr_fr: Désactiver le partage social des résultats

source: Note: It is an option only available for logged in users. Check this to disable the social sharing feature for users.
fr_fr: Remarque : Cette option n'est disponible que pour les utilisateurs connectés. Cochez cette case pour désactiver la fonction de partage social pour les utilisateurs.

source: Disable results statistics
fr_fr: Désactiver les statistiques de résultats

source: Check this option to disable saving statistics to the database and displaying them to the user.<br>Note: Saving statistics to the database and displaying frontend statistics are options valid only for member users.
fr_fr: Cochez cette option pour désactiver l'enregistrement des statistiques dans la base de données et leur affichage pour l'utilisateur.<br>Remarque : L'enregistrement des statistiques dans la base de données et l'affichage des statistiques sur le site sont des options valables uniquement pour les utilisateurs membres.

source: Choose the page to link to for sales.
fr_fr: Choisissez la page vers laquelle créer un lien pour les ventes.

source: Number of free trials per day:
fr_fr: Nombre d’essais gratuits par jour :

source: times a day
fr_fr: fois par jour

source: Specify how many free trials are allowed per day (default is 3).
fr_fr: Spécifiez le nombre d’essais gratuits autorisés par jour (la valeur par défaut est 3).

source: Number of questions per quiz:
fr_fr: Nombre de questions par quiz :

source: questions per quiz
fr_fr: questions par quiz

source: Levels
fr_fr: Niveaux

source: Performance
fr_fr: Performances

source: Advanced Stats
fr_fr: Statistiques Avancées

source: Data successfully imported.
fr_fr: Données importées avec succès.

source: Import/Export Data
fr_fr: Importer/Exporter des données

source: Export Data
fr_fr: Exporter des données

source: Select the data you want to export:
fr_fr: Sélectionnez les données que vous souhaitez exporter :

source: Please select at least one export option.
fr_fr: Veuillez sélectionner au moins une option d’exportation.

source: Select All
fr_fr: Tout sélectionner

source: Export for specific user (optional):
fr_fr: Exporter pour un utilisateur spécifique (facultatif) :

source: All Users
fr_fr: Tous les utilisateurs

source: Export
fr_fr: Exporter

source: Import Data
fr_fr: Importer des données

source: Select the JSON file to import:
fr_fr: Sélectionnez le fichier JSON à importer :

source: Maximum file size: 10MB. JSON format only.
fr_fr: Taille maximale du fichier : 10 Mo. Format JSON uniquement.

source: Import
fr_fr: Importer

source: Insufficient permissions for data export.
fr_fr: Autorisations insuffisantes pour l’exportation des données.

source: Security verification failed.
fr_fr: La vérification de sécurité a échoué.

source: Insufficient permissions for data import.
fr_fr: Autorisations insuffisantes pour l’importation de données.

source: File upload failed.
fr_fr: Le téléchargement du fichier a échoué.

source: File size exceeds maximum limit of %d MB.
fr_fr: La taille du fichier dépasse la limite maximale de %d Mo.

source: Invalid file type. JSON files only.
fr_fr: Type de fichier non valide. Fichiers JSON uniquement.

source: Invalid JSON file.
fr_fr: Fichier JSON non valide.

source: Invalid import data: No valid data sections found.
fr_fr: Données d’importation non valides : aucune section de données valide trouvée.

source: Import failed: %s
fr_fr: Échec de l’importation : %s

source: Display detailed user statistics across posts, pages, or widgets.
fr_fr: Affiche des statistiques détaillées sur les utilisateurs dans les articles, les pages ou les widgets.

source: Show the number of remaining free quiz attempts with a user-friendly message.
fr_fr: Affiche le nombre de tentatives de quiz libres restantes avec un message convivial.

source: Display comparative statistics between users.
fr_fr: Affiche les statistiques comparatives entre les utilisateurs.

source: Renders the quiz form.
fr_fr: Affiche le formulaire de quiz.

source: Display the badges awarded to the currently logged-in user.
fr_fr: Affiche les badges attribués à l'utilisateur actuellement connecté.

source: Display the periodic statistics (weekly and monthly) of a user, including success rates and quiz performance by level.
fr_fr: Affichez les statistiques périodiques (hebdomadaires et mensuelles) d’un utilisateur, y compris les taux de réussite et les performances au quiz par niveau.

source: New
fr_fr: Nouveau

source: Questions & Levels:
fr_fr: Questions & Niveaux :

source: Get All Questions:
fr_fr: Obtenir tous les questions :

source: This API retrieves all questions from the quizzes. It returns a list of questions containing information about each question, including the level, the text of the question in different languages, available options, and the correct answer.
fr_fr: Cette API récupère toutes les questions des quiz. Elle renvoie une liste de questions contenant des informations sur chaque question, notamment le niveau, le texte de la question dans différentes langues, les options disponibles et la bonne réponse.

source: The unique identifier of the question.
fr_fr: L’identifiant unique de la question.

source: The text of the question in the primary language.
fr_fr: Le texte de la question dans la langue principale.

source: The text of the question in an alternate language.
fr_fr: Le texte de la question dans une autre langue.

source: A JSON string array of available options for the question.
fr_fr: Un tableau de chaînes JSON d’options disponibles pour la question.

source: The index of the correct answer in the options array (zero-based).
fr_fr: L’index de la réponse correcte dans le tableau d’options (de base zéro).

source: Get Question by ID:
fr_fr: Obtenir le question par son identifiant :

source: Get Questions by Level:
fr_fr: Obtenez les questions par niveau:

source: Get All Quiz Levels:
fr_fr: Obtenez tous les niveaux du quiz :

source: This API retrieves all available levels for quizzes. It returns a list of levels, including their names, labels, and whether they are free or paid.
fr_fr: Cette API récupère tous les niveaux disponibles pour les quiz. Elle renvoie une liste de niveaux, y compris leurs noms, leurs libellés et leur caractère gratuit ou payant.

source: The unique identifier for the level (e.g., "beginner").
fr_fr: L’identifiant unique du niveau (par exemple, « débutant »).

source: The display name of the level (e.g., "Beginner").
fr_fr: Le nom d’affichage du niveau (par exemple, « Débutant »).

source: A boolean indicating whether the level is free (true) or paid (false).
fr_fr: Un booléen indiquant si le niveau est gratuit (true) ou payant (false).

source: Get Quiz Level by Name:
fr_fr: Obtenir le niveau du quiz par nom :

source: Get Quiz Levels by Type:
fr_fr: Obtenir le niveau du quiz par type :

source: Get User Performance:
fr_fr: Obtenir les performances de l'utilisateur :

source: This API retrieves the performance metrics for a specific user, including their quiz attempts and success rates across different levels.
fr_fr: Cette API récupère les mesures de performance d’un utilisateur spécifique, y compris ses tentatives de quiz et ses taux de réussite à différents niveaux.

source: The unique identifier for the performance entry.
fr_fr: L’identifiant unique de l’entrée de performance.

source: The identifier of the user whose performance is being retrieved.
fr_fr: L’identifiant de l’utilisateur dont la performance est récupérée.

source: The quiz level for which the performance is recorded.
fr_fr: Le niveau du quiz pour lequel la performance est enregistrée.

source: The total number of quizzes attempted by the user at this level.
fr_fr: Le nombre total de quiz tentés par l’utilisateur à ce niveau.

source: The total number of questions answered by the user at this level.
fr_fr: Le nombre total de questions auxquelles l’utilisateur a répondu à ce niveau.

source: The total number of correct answers provided by the user.
fr_fr: Le nombre total de réponses correctes fournies par l’utilisateur.

source: The percentage of correct answers.
fr_fr: Le pourcentage de réponses correctes.

source: The highest score achieved by the user in quizzes at this level.
fr_fr: Le score le plus élevé obtenu par l’utilisateur dans les quiz à ce niveau.

source: The date and time when the performance data was last updated.
fr_fr: La date et l’heure de la dernière mise à jour des données de performance.

source: Get User Badges:
fr_fr: Obtenir les badges de l'utilisateur :

source: Update User Performance:
fr_fr: Mettre à jour les performances de l'utilisateur:

source: This API updates or inserts performance metrics for a specific user at a particular quiz level. The data includes quiz attempts, correct answers, success rates, and best scores for the user, along with the timestamp of the last update.
fr_fr: Cette API met à jour ou insère des mesures de performances pour un utilisateur spécifique à un niveau de quiz particulier. Les données incluent les tentatives de quiz, les réponses correctes, les taux de réussite et les meilleurs scores de l’utilisateur, ainsi que l’horodatage de la dernière mise à jour.

source: The unique identifier for the user whose performance is being updated. This is a required parameter.
fr_fr: Identifiant unique de l’utilisateur dont les performances sont mises à jour. Il s’agit d’un paramètre obligatoire.

source: The quiz level (e.g., "beginner", "intermediate", "advanced") for which the performance is being recorded. This is a required parameter.
fr_fr: Le niveau du quiz (par exemple, « débutant », « intermédiaire », « avancé ») pour lequel la performance est enregistrée. Il s’agit d’un paramètre obligatoire.

source: The total number of quizzes attempted by the user at the specified level. This is a required parameter.
fr_fr: Nombre total de quiz tentés par l’utilisateur au niveau spécifié. Il s’agit d’un paramètre obligatoire.

source: The total number of questions answered by the user at the specified level. This is a required parameter.
fr_fr: Nombre total de questions auxquelles l’utilisateur a répondu au niveau spécifié. Il s’agit d’un paramètre obligatoire.

source: The total number of correct answers provided by the user at the specified level. This is a required parameter.
fr_fr: Nombre total de réponses correctes fournies par l’utilisateur au niveau spécifié. Il s’agit d’un paramètre obligatoire.

source: The percentage of correct answers calculated as (total good answers / total questions answered) * 100. This is a required parameter.
fr_fr: Le pourcentage de réponses correctes calculé comme (total des bonnes réponses / total des questions répondues) * 100. Il s’agit d’un paramètre obligatoire.

source: The highest score achieved by the user at the specified level. This is a required parameter.
fr_fr: Le score le plus élevé atteint par l’utilisateur au niveau spécifié. Il s’agit d’un paramètre obligatoire.

source: Get Badge Settings:
fr_fr: Obtenir les paramètres du badge :

source: Get Specific Badge Type Settings:
fr_fr: Obtenir les paramètres spécifiques du type de badge :

source: Get All Users Badges:
fr_fr: Obtenez les badges de tous les utilisateurs :

source: This API retrieves all badges awarded to users. It returns a list of badges containing information about each user who has received one or more badges, along with details about those badges.
fr_fr: Cette API récupère tous les badges attribués aux utilisateurs. Elle renvoie une liste de badges contenant des informations sur chaque utilisateur ayant reçu un ou plusieurs badges, ainsi que des détails sur ces badges.

source: (optional) The page number to retrieve. Defaults to the first page.
fr_fr: (facultatif) Le numéro de page à récupérer. La valeur par défaut est la première page.

source: (optional) The number of badges to return per page. Defaults to 10 badges.
fr_fr: (facultatif) Le nombre de badges à renvoyer par page. La valeur par défaut est 10 badges.

source: The unique identifier of the badge/user association in the database.
fr_fr: L’identifiant unique de l’association badge/utilisateur dans la base de données.

source: An object containing information about the user:
fr_fr: Un objet contenant des informations sur l’utilisateur :

source: The user identifier.
fr_fr: L’identifiant de l’utilisateur.

source: The display name of the user.
fr_fr: Le nom d’affichage de l’utilisateur.

source: The user's email address.
fr_fr: L’adresse e-mail de l’utilisateur.

source: An object containing details about the badge:
fr_fr: Un objet contenant des détails sur le badge :

source: The type of badge (e.g., "completion-badge" or "success-rate-badge").
fr_fr: Le type de badge (par exemple, « completion-badge » ou « success-rate-badge »).

source: The name of the badge.
fr_fr: Le nom du badge.

source: The threshold required to earn the badge, or null if not applicable.
fr_fr: Le seuil requis pour obtenir le badge, ou nul si non applicable.

source: The ID of the image associated with the badge.
fr_fr: L’ID de l’image associée au badge.

source: The URL of the badge image, or null if not available.
fr_fr: L’URL de l’image du badge, ou null si non disponible.

source: The date the badge was awarded.
fr_fr: La date à laquelle le badge a été attribué.

source: The achievement value that triggered the badge award.
fr_fr: La valeur de réussite qui a déclenché l’attribution du badge.

source: Changelog and User Guide
fr_fr: Guide et changelog

source: User Guide
fr_fr: Guide d'utilisation

source: Here you can find the user guide for the plugin.
fr_fr: Vous trouverez ici le guide d'utilisation du plugin.

source: Available Shortcodes:
fr_fr: Shortcodes disponibles :

source: Copy shortcode
fr_fr: Copier le shortcode

source: API Documentation:
fr_fr: Documentation de l'API :

source: The plugin provides a REST API for accessing quiz data. Below are the available routes:
fr_fr: Le plugin fournit une API REST pour accéder aux données du quiz. Vous trouverez ci-dessous les itinéraires disponibles :

source: Available Routes:
fr_fr: Routes disponibles :

source: API Description
fr_fr: Description de l’API

source: Query Parameters
fr_fr: Paramètres de la requête

source: Response
fr_fr: Réponse

source: The response is an array of objects containing the following informations:
fr_fr: La réponse est un tableau d’objets contenant les informations suivantes :
